ataradov/mcu-starter-projects/samg53/include/component/twihs.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIHS_TPR_OFFSET                    (0x108)                                       /**<  (TWIHS_TPR) Transmit Pointer Register  Offset */

#define TWIHS_TPR_TXPTR_Pos                 0                                              /**< (TWIHS_TPR) Transmit Counter Register Position */
#define TWIHS_TPR_TXPTR_Msk                 (_U_(0xFFFFFFFF) << TWIHS_TPR_TXPTR_Pos)       /**< (TWIHS_TPR) Transmit Counter Register Mask */
#define TWIHS_TPR_TXPTR(value)              (TWIHS_TPR_TXPTR_Msk & ((value) << TWIHS_TPR_TXPTR_Pos))
#define TWIHS_TPR_MASK                      _U_(0xFFFFFFFF)                                /**< \deprecated (TWIHS_TPR) Register MASK  (Use TWIHS_TPR_Msk instead)  */
#define TWIHS_TPR_Msk                       _U_(0xFFFFFFFF)                                /**< (TWIHS_TPR) Register Mask  */


/* -------- TWIHS_TCR : (TWIHS Offset: 0x10c) (R/W 32) Transmit Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXCTR:16;                  /**< bit:  0..15  Transmit Counter Register                */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TWIHS_TCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIHS_TCR_OFFSET                    (0x10C)                                       /**<  (TWIHS_TCR) Transmit Counter Register  Offset */

#define TWIHS_TCR_TXCTR_Pos                 0                                              /**< (TWIHS_TCR) Transmit Counter Register Position */
#define TWIHS_TCR_TXCTR_Msk                 (_U_(0xFFFF) << TWIHS_TCR_TXCTR_Pos)           /**< (TWIHS_TCR) Transmit Counter Register Mask */
#define TWIHS_TCR_TXCTR(value)              (TWIHS_TCR_TXCTR_Msk & ((value) << TWIHS_TCR_TXCTR_Pos))
#define TWIHS_TCR_MASK                      _U_(0xFFFF)                                    /**< \deprecated (TWIHS_TCR) Register MASK  (Use TWIHS_TCR_Msk instead)  */
#define TWIHS_TCR_Msk                       _U_(0xFFFF)                                    /**< (TWIHS_TCR) Register Mask  */


/* -------- TWIHS_RNPR : (TWIHS Offset: 0x110) (R/W 32) Receive Next Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXNPTR:32;                 /**< bit:  0..31  Receive Next Pointer                     */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TWIHS_RNPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIHS_RNPR_OFFSET                   (0x110)                                       /**<  (TWIHS_RNPR) Receive Next Pointer Register  Offset */

#define TWIHS_RNPR_RXNPTR_Pos               0                                              /**< (TWIHS_RNPR) Receive Next Pointer Position */
#define TWIHS_RNPR_RXNPTR_Msk               (_U_(0xFFFFFFFF) << TWIHS_RNPR_RXNPTR_Pos)     /**< (TWIHS_RNPR) Receive Next Pointer Mask */
#define TWIHS_RNPR_RXNPTR(value)            (TWIHS_RNPR_RXNPTR_Msk & ((value) << TWIHS_RNPR_RXNPTR_Pos))
#define TWIHS_RNPR_MASK                     _U_(0xFFFFFFFF)                                /**< \deprecated (TWIHS_RNPR) Register MASK  (Use TWIHS_RNPR_Msk instead)  */
#define TWIHS_RNPR_Msk                      _U_(0xFFFFFFFF)                                /**< (TWIHS_RNPR) Register Mask  */


/* -------- TWIHS_RNCR : (TWIHS Offset: 0x114) (R/W 32) Receive Next Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXNCTR:16;                 /**< bit:  0..15  Receive Next Counter                     */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TWIHS_RNCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIHS_RNCR_OFFSET                   (0x114)                                       /**<  (TWIHS_RNCR) Receive Next Counter Register  Offset */

#define TWIHS_RNCR_RXNCTR_Pos               0                                              /**< (TWIHS_RNCR) Receive Next Counter Position */
#define TWIHS_RNCR_RXNCTR_Msk               (_U_(0xFFFF) << TWIHS_RNCR_RXNCTR_Pos)         /**< (TWIHS_RNCR) Receive Next Counter Mask */
#define TWIHS_RNCR_RXNCTR(value)            (TWIHS_RNCR_RXNCTR_Msk & ((value) << TWIHS_RNCR_RXNCTR_Pos))
#define TWIHS_RNCR_MASK                     _U_(0xFFFF)                                    /**< \deprecated (TWIHS_RNCR) Register MASK  (Use TWIHS_RNCR_Msk instead)  */
#define TWIHS_RNCR_Msk                      _U_(0xFFFF)                                    /**< (TWIHS_RNCR) Register Mask  */


/* -------- TWIHS_TNPR : (TWIHS Offset: 0x118) (R/W 32) Transmit Next Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXNPTR:32;                 /**< bit:  0..31  Transmit Next Pointer                    */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TWIHS_TNPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIHS_TNPR_OFFSET                   (0x118)                                       /**<  (TWIHS_TNPR) Transmit Next Pointer Register  Offset */

#define TWIHS_TNPR_TXNPTR_Pos               0                                              /**< (TWIHS_TNPR) Transmit Next Pointer Position */
#define TWIHS_TNPR_TXNPTR_Msk               (_U_(0xFFFFFFFF) << TWIHS_TNPR_TXNPTR_Pos)     /**< (TWIHS_TNPR) Transmit Next Pointer Mask */
#define TWIHS_TNPR_TXNPTR(value)            (TWIHS_TNPR_TXNPTR_Msk & ((value) << TWIHS_TNPR_TXNPTR_Pos))
#define TWIHS_TNPR_MASK                     _U_(0xFFFFFFFF)                                /**< \deprecated (TWIHS_TNPR) Register MASK  (Use TWIHS_TNPR_Msk instead)  */
#define TWIHS_TNPR_Msk                      _U_(0xFFFFFFFF)                                /**< (TWIHS_TNPR) Register Mask  */


/* -------- TWIHS_TNCR : (TWIHS Offset: 0x11c) (R/W 32) Transmit Next Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXNCTR:16;                 /**< bit:  0..15  Transmit Counter Next                    */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TWIHS_TNCR_Type;
