ataradov/mcu-starter-projects/samg53/include/component/twihs.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIHS_TNCR_OFFSET                   (0x11C)                                       /**<  (TWIHS_TNCR) Transmit Next Counter Register  Offset */

#define TWIHS_TNCR_TXNCTR_Pos               0                                              /**< (TWIHS_TNCR) Transmit Counter Next Position */
#define TWIHS_TNCR_TXNCTR_Msk               (_U_(0xFFFF) << TWIHS_TNCR_TXNCTR_Pos)         /**< (TWIHS_TNCR) Transmit Counter Next Mask */
#define TWIHS_TNCR_TXNCTR(value)            (TWIHS_TNCR_TXNCTR_Msk & ((value) << TWIHS_TNCR_TXNCTR_Pos))
#define TWIHS_TNCR_MASK                     _U_(0xFFFF)                                    /**< \deprecated (TWIHS_TNCR) Register MASK  (Use TWIHS_TNCR_Msk instead)  */
#define TWIHS_TNCR_Msk                      _U_(0xFFFF)                                    /**< (TWIHS_TNCR) Register Mask  */


/* -------- TWIHS_PTCR : (TWIHS Offset: 0x120) (/W 32) Transfer Control Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXTEN:1;                   /**< bit:      0  Receiver Transfer Enable                 */
    uint32_t RXTDIS:1;                  /**< bit:      1  Receiver Transfer Disable                */
    uint32_t :6;                        /**< bit:   2..7  Reserved */
    uint32_t TXTEN:1;                   /**< bit:      8  Transmitter Transfer Enable              */
    uint32_t TXTDIS:1;                  /**< bit:      9  Transmitter Transfer Disable             */
    uint32_t :6;                        /**< bit: 10..15  Reserved */
    uint32_t RXCBEN:1;                  /**< bit:     16  Receiver Circular Buffer Enable          */
    uint32_t RXCBDIS:1;                 /**< bit:     17  Receiver Circular Buffer Disable         */
    uint32_t TXCBEN:1;                  /**< bit:     18  Transmitter Circular Buffer Enable       */
    uint32_t TXCBDIS:1;                 /**< bit:     19  Transmitter Circular Buffer Disable      */
    uint32_t :4;                        /**< bit: 20..23  Reserved */
    uint32_t ERRCLR:1;                  /**< bit:     24  Transfer Bus Error Clear                 */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TWIHS_PTCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIHS_PTCR_OFFSET                   (0x120)                                       /**<  (TWIHS_PTCR) Transfer Control Register  Offset */

#define TWIHS_PTCR_RXTEN_Pos                0                                              /**< (TWIHS_PTCR) Receiver Transfer Enable Position */
#define TWIHS_PTCR_RXTEN_Msk                (_U_(0x1) << TWIHS_PTCR_RXTEN_Pos)             /**< (TWIHS_PTCR) Receiver Transfer Enable Mask */
#define TWIHS_PTCR_RXTEN                    TWIHS_PTCR_RXTEN_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWIHS_PTCR_RXTEN_Msk instead */
#define TWIHS_PTCR_RXTDIS_Pos               1                                              /**< (TWIHS_PTCR) Receiver Transfer Disable Position */
#define TWIHS_PTCR_RXTDIS_Msk               (_U_(0x1) << TWIHS_PTCR_RXTDIS_Pos)            /**< (TWIHS_PTCR) Receiver Transfer Disable Mask */
#define TWIHS_PTCR_RXTDIS                   TWIHS_PTCR_RXTDIS_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWIHS_PTCR_RXTDIS_Msk instead */
#define TWIHS_PTCR_TXTEN_Pos                8                                              /**< (TWIHS_PTCR) Transmitter Transfer Enable Position */
#define TWIHS_PTCR_TXTEN_Msk                (_U_(0x1) << TWIHS_PTCR_TXTEN_Pos)             /**< (TWIHS_PTCR) Transmitter Transfer Enable Mask */
#define TWIHS_PTCR_TXTEN                    TWIHS_PTCR_TXTEN_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWIHS_PTCR_TXTEN_Msk instead */
#define TWIHS_PTCR_TXTDIS_Pos               9                                              /**< (TWIHS_PTCR) Transmitter Transfer Disable Position */
#define TWIHS_PTCR_TXTDIS_Msk               (_U_(0x1) << TWIHS_PTCR_TXTDIS_Pos)            /**< (TWIHS_PTCR) Transmitter Transfer Disable Mask */
#define TWIHS_PTCR_TXTDIS                   TWIHS_PTCR_TXTDIS_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWIHS_PTCR_TXTDIS_Msk instead */
#define TWIHS_PTCR_RXCBEN_Pos               16                                             /**< (TWIHS_PTCR) Receiver Circular Buffer Enable Position */
#define TWIHS_PTCR_RXCBEN_Msk               (_U_(0x1) << TWIHS_PTCR_RXCBEN_Pos)            /**< (TWIHS_PTCR) Receiver Circular Buffer Enable Mask */
#define TWIHS_PTCR_RXCBEN                   TWIHS_PTCR_RXCBEN_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWIHS_PTCR_RXCBEN_Msk instead */
#define TWIHS_PTCR_RXCBDIS_Pos              17                                             /**< (TWIHS_PTCR) Receiver Circular Buffer Disable Position */
#define TWIHS_PTCR_RXCBDIS_Msk              (_U_(0x1) << TWIHS_PTCR_RXCBDIS_Pos)           /**< (TWIHS_PTCR) Receiver Circular Buffer Disable Mask */
#define TWIHS_PTCR_RXCBDIS                  TWIHS_PTCR_RXCBDIS_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWIHS_PTCR_RXCBDIS_Msk instead */
#define TWIHS_PTCR_TXCBEN_Pos               18                                             /**< (TWIHS_PTCR) Transmitter Circular Buffer Enable Position */
#define TWIHS_PTCR_TXCBEN_Msk               (_U_(0x1) << TWIHS_PTCR_TXCBEN_Pos)            /**< (TWIHS_PTCR) Transmitter Circular Buffer Enable Mask */
#define TWIHS_PTCR_TXCBEN                   TWIHS_PTCR_TXCBEN_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWIHS_PTCR_TXCBEN_Msk instead */
#define TWIHS_PTCR_TXCBDIS_Pos              19                                             /**< (TWIHS_PTCR) Transmitter Circular Buffer Disable Position */
#define TWIHS_PTCR_TXCBDIS_Msk              (_U_(0x1) << TWIHS_PTCR_TXCBDIS_Pos)           /**< (TWIHS_PTCR) Transmitter Circular Buffer Disable Mask */
#define TWIHS_PTCR_TXCBDIS                  TWIHS_PTCR_TXCBDIS_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWIHS_PTCR_TXCBDIS_Msk instead */
#define TWIHS_PTCR_ERRCLR_Pos               24                                             /**< (TWIHS_PTCR) Transfer Bus Error Clear Position */
#define TWIHS_PTCR_ERRCLR_Msk               (_U_(0x1) << TWIHS_PTCR_ERRCLR_Pos)            /**< (TWIHS_PTCR) Transfer Bus Error Clear Mask */
#define TWIHS_PTCR_ERRCLR                   TWIHS_PTCR_ERRCLR_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWIHS_PTCR_ERRCLR_Msk instead */
#define TWIHS_PTCR_MASK                     _U_(0x10F0303)                                 /**< \deprecated (TWIHS_PTCR) Register MASK  (Use TWIHS_PTCR_Msk instead)  */
#define TWIHS_PTCR_Msk                      _U_(0x10F0303)                                 /**< (TWIHS_PTCR) Register Mask  */


/* -------- TWIHS_PTSR : (TWIHS Offset: 0x124) (R/ 32) Transfer Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXTEN:1;                   /**< bit:      0  Receiver Transfer Enable                 */
    uint32_t :7;                        /**< bit:   1..7  Reserved */
    uint32_t TXTEN:1;                   /**< bit:      8  Transmitter Transfer Enable              */
    uint32_t :7;                        /**< bit:  9..15  Reserved */
    uint32_t RXCBEN:1;                  /**< bit:     16  Receiver Circular Buffer Enable          */
    uint32_t :1;                        /**< bit:     17  Reserved */
    uint32_t TXCBEN:1;                  /**< bit:     18  Transmitter Circular Buffer Enable       */
    uint32_t :5;                        /**< bit: 19..23  Reserved */
    uint32_t ERR:1;                     /**< bit:     24  Transfer Bus Error                       */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TWIHS_PTSR_Type;
