ataradov/mcu-starter-projects/samg53/include/component/twihs.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIHS_PTSR_OFFSET                   (0x124)                                       /**<  (TWIHS_PTSR) Transfer Status Register  Offset */

#define TWIHS_PTSR_RXTEN_Pos                0                                              /**< (TWIHS_PTSR) Receiver Transfer Enable Position */
#define TWIHS_PTSR_RXTEN_Msk                (_U_(0x1) << TWIHS_PTSR_RXTEN_Pos)             /**< (TWIHS_PTSR) Receiver Transfer Enable Mask */
#define TWIHS_PTSR_RXTEN                    TWIHS_PTSR_RXTEN_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWIHS_PTSR_RXTEN_Msk instead */
#define TWIHS_PTSR_TXTEN_Pos                8                                              /**< (TWIHS_PTSR) Transmitter Transfer Enable Position */
#define TWIHS_PTSR_TXTEN_Msk                (_U_(0x1) << TWIHS_PTSR_TXTEN_Pos)             /**< (TWIHS_PTSR) Transmitter Transfer Enable Mask */
#define TWIHS_PTSR_TXTEN                    TWIHS_PTSR_TXTEN_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWIHS_PTSR_TXTEN_Msk instead */
#define TWIHS_PTSR_RXCBEN_Pos               16                                             /**< (TWIHS_PTSR) Receiver Circular Buffer Enable Position */
#define TWIHS_PTSR_RXCBEN_Msk               (_U_(0x1) << TWIHS_PTSR_RXCBEN_Pos)            /**< (TWIHS_PTSR) Receiver Circular Buffer Enable Mask */
#define TWIHS_PTSR_RXCBEN                   TWIHS_PTSR_RXCBEN_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWIHS_PTSR_RXCBEN_Msk instead */
#define TWIHS_PTSR_TXCBEN_Pos               18                                             /**< (TWIHS_PTSR) Transmitter Circular Buffer Enable Position */
#define TWIHS_PTSR_TXCBEN_Msk               (_U_(0x1) << TWIHS_PTSR_TXCBEN_Pos)            /**< (TWIHS_PTSR) Transmitter Circular Buffer Enable Mask */
#define TWIHS_PTSR_TXCBEN                   TWIHS_PTSR_TXCBEN_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWIHS_PTSR_TXCBEN_Msk instead */
#define TWIHS_PTSR_ERR_Pos                  24                                             /**< (TWIHS_PTSR) Transfer Bus Error Position */
#define TWIHS_PTSR_ERR_Msk                  (_U_(0x1) << TWIHS_PTSR_ERR_Pos)               /**< (TWIHS_PTSR) Transfer Bus Error Mask */
#define TWIHS_PTSR_ERR                      TWIHS_PTSR_ERR_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWIHS_PTSR_ERR_Msk instead */
#define TWIHS_PTSR_MASK                     _U_(0x1050101)                                 /**< \deprecated (TWIHS_PTSR) Register MASK  (Use TWIHS_PTSR_Msk instead)  */
#define TWIHS_PTSR_Msk                      _U_(0x1050101)                                 /**< (TWIHS_PTSR) Register Mask  */


#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief TWIHS hardware registers */
typedef struct {  
  __O  uint32_t TWIHS_CR;       /**< (TWIHS Offset: 0x00) Control Register */
  __IO uint32_t TWIHS_MMR;      /**< (TWIHS Offset: 0x04) Master Mode Register */
  __IO uint32_t TWIHS_SMR;      /**< (TWIHS Offset: 0x08) Slave Mode Register */
  __IO uint32_t TWIHS_IADR;     /**< (TWIHS Offset: 0x0C) Internal Address Register */
  __IO uint32_t TWIHS_CWGR;     /**< (TWIHS Offset: 0x10) Clock Waveform Generator Register */
  RoReg8  Reserved1[0xC];
  __I  uint32_t TWIHS_SR;       /**< (TWIHS Offset: 0x20) Status Register */
  __O  uint32_t TWIHS_IER;      /**< (TWIHS Offset: 0x24) Interrupt Enable Register */
  __O  uint32_t TWIHS_IDR;      /**< (TWIHS Offset: 0x28) Interrupt Disable Register */
  __I  uint32_t TWIHS_IMR;      /**< (TWIHS Offset: 0x2C) Interrupt Mask Register */
  __I  uint32_t TWIHS_RHR;      /**< (TWIHS Offset: 0x30) Receive Holding Register */
  __O  uint32_t TWIHS_THR;      /**< (TWIHS Offset: 0x34) Transmit Holding Register */
  __IO uint32_t TWIHS_SMBTR;    /**< (TWIHS Offset: 0x38) SMBus Timing Register */
  RoReg8  Reserved2[0x8];
  __IO uint32_t TWIHS_FILTR;    /**< (TWIHS Offset: 0x44) Filter Register */
  RoReg8  Reserved3[0x4];
  __IO uint32_t TWIHS_SWMR;     /**< (TWIHS Offset: 0x4C) SleepWalking Matching Register */
  RoReg8  Reserved4[0x94];
  __IO uint32_t TWIHS_WPMR;     /**< (TWIHS Offset: 0xE4) Write Protection Mode Register */
  __I  uint32_t TWIHS_WPSR;     /**< (TWIHS Offset: 0xE8) Write Protection Status Register */
  RoReg8  Reserved5[0x14];
  __IO uint32_t TWIHS_RPR;      /**< (TWIHS Offset: 0x100) Receive Pointer Register */
  __IO uint32_t TWIHS_RCR;      /**< (TWIHS Offset: 0x104) Receive Counter Register */
  __IO uint32_t TWIHS_TPR;      /**< (TWIHS Offset: 0x108) Transmit Pointer Register */
  __IO uint32_t TWIHS_TCR;      /**< (TWIHS Offset: 0x10C) Transmit Counter Register */
  __IO uint32_t TWIHS_RNPR;     /**< (TWIHS Offset: 0x110) Receive Next Pointer Register */
  __IO uint32_t TWIHS_RNCR;     /**< (TWIHS Offset: 0x114) Receive Next Counter Register */
  __IO uint32_t TWIHS_TNPR;     /**< (TWIHS Offset: 0x118) Transmit Next Pointer Register */
  __IO uint32_t TWIHS_TNCR;     /**< (TWIHS Offset: 0x11C) Transmit Next Counter Register */
  __O  uint32_t TWIHS_PTCR;     /**< (TWIHS Offset: 0x120) Transfer Control Register */
  __I  uint32_t TWIHS_PTSR;     /**< (TWIHS Offset: 0x124) Transfer Status Register */
} Twihs;

#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief TWIHS hardware registers */
typedef struct {  
  __O  TWIHS_CR_Type                  TWIHS_CR;       /**< Offset: 0x00 ( /W  32) Control Register */
  __IO TWIHS_MMR_Type                 TWIHS_MMR;      /**< Offset: 0x04 (R/W  32) Master Mode Register */
  __IO TWIHS_SMR_Type                 TWIHS_SMR;      /**< Offset: 0x08 (R/W  32) Slave Mode Register */
  __IO TWIHS_IADR_Type                TWIHS_IADR;     /**< Offset: 0x0C (R/W  32) Internal Address Register */
  __IO TWIHS_CWGR_Type                TWIHS_CWGR;     /**< Offset: 0x10 (R/W  32) Clock Waveform Generator Register */
  __I  uint32_t                       Reserved1[3];
  __I  TWIHS_SR_Type                  TWIHS_SR;       /**< Offset: 0x20 (R/   32) Status Register */
  __O  TWIHS_IER_Type                 TWIHS_IER;      /**< Offset: 0x24 ( /W  32) Interrupt Enable Register */
  __O  TWIHS_IDR_Type                 TWIHS_IDR;      /**< Offset: 0x28 ( /W  32) Interrupt Disable Register */
  __I  TWIHS_IMR_Type                 TWIHS_IMR;      /**< Offset: 0x2C (R/   32) Interrupt Mask Register */
  __I  TWIHS_RHR_Type                 TWIHS_RHR;      /**< Offset: 0x30 (R/   32) Receive Holding Register */
  __O  TWIHS_THR_Type                 TWIHS_THR;      /**< Offset: 0x34 ( /W  32) Transmit Holding Register */
  __IO TWIHS_SMBTR_Type               TWIHS_SMBTR;    /**< Offset: 0x38 (R/W  32) SMBus Timing Register */
  __I  uint32_t                       Reserved2[2];
  __IO TWIHS_FILTR_Type               TWIHS_FILTR;    /**< Offset: 0x44 (R/W  32) Filter Register */
  __I  uint32_t                       Reserved3[1];
  __IO TWIHS_SWMR_Type                TWIHS_SWMR;     /**< Offset: 0x4C (R/W  32) SleepWalking Matching Register */
  __I  uint32_t                       Reserved4[37];
  __IO TWIHS_WPMR_Type                TWIHS_WPMR;     /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I  TWIHS_WPSR_Type                TWIHS_WPSR;     /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
  __I  uint32_t                       Reserved5[5];
  __IO TWIHS_RPR_Type                 TWIHS_RPR;      /**< Offset: 0x100 (R/W  32) Receive Pointer Register */
  __IO TWIHS_RCR_Type                 TWIHS_RCR;      /**< Offset: 0x104 (R/W  32) Receive Counter Register */
  __IO TWIHS_TPR_Type                 TWIHS_TPR;      /**< Offset: 0x108 (R/W  32) Transmit Pointer Register */
  __IO TWIHS_TCR_Type                 TWIHS_TCR;      /**< Offset: 0x10C (R/W  32) Transmit Counter Register */
  __IO TWIHS_RNPR_Type                TWIHS_RNPR;     /**< Offset: 0x110 (R/W  32) Receive Next Pointer Register */
  __IO TWIHS_RNCR_Type                TWIHS_RNCR;     /**< Offset: 0x114 (R/W  32) Receive Next Counter Register */
  __IO TWIHS_TNPR_Type                TWIHS_TNPR;     /**< Offset: 0x118 (R/W  32) Transmit Next Pointer Register */
  __IO TWIHS_TNCR_Type                TWIHS_TNCR;     /**< Offset: 0x11C (R/W  32) Transmit Next Counter Register */
  __O  TWIHS_PTCR_Type                TWIHS_PTCR;     /**< Offset: 0x120 ( /W  32) Transfer Control Register */
  __I  TWIHS_PTSR_Type                TWIHS_PTSR;     /**< Offset: 0x124 (R/   32) Transfer Status Register */
} Twihs;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of Two-wire Interface High Speed */

#endif /* _SAMG53_TWIHS_COMPONENT_H_ */
